using Microsoft.EntityFrameworkCore;

namespace TopFilms.Models
{
    public class FilmsContext : DbContext
    {
        public DbSet<Film> Films { get; set; }

        public FilmsContext(DbContextOptions<FilmsContext> options)
           : base(options)
        {
            Database.EnsureCreated();
        }

   
        protected override void OnModelCreating(ModelBuilder modelBuilder)
        {
            base.OnModelCreating(modelBuilder);

            modelBuilder.Entity<Film>().HasData(
                new Film { Id = 1, 
                    Name = "Їсти, молитися, кохати", 
                    Director = "Райан Мёрфи", 
                    Genre = "біографія, комедія, драма, мелодрама", 
                    Year = 2010,
                    Poster = "/posters/eat.love.jpg",
                    Info = "Елізабет Гілберт здавалося, що вона досягла всього: успішна письменницька кар'єра, стабільний шлюб, " +
                "розкішний будинок у Нью-Йорку. Але за фасадом ідеального життя ховалася глибока порожнеча та нічне безсоння на " +
                "підлозі у ванній кімнаті. Усвідомивши, що вона більше не знає, хто вона і чого насправді хоче, Елізабет " +
                "наважується на радикальний крок, який багато хто вважав би божевіллям.\r\n\r\nВона подає на розлучення і, " +
                "залишивши позаду все нажите майно та звичний комфорт, вирушає у кругосвітню подорож на цілий рік. Її маршрут — " +
                "це не просто туристична поїздка, а три етапи духовного та емоційного відновлення.\r\n\r\nІталія (Їсти): " +
                "Чотири місяці в Римі та Неаполі вчать Елізабет найголовнішому — вмінню насолоджуватися моментом без почуття " +
                "провини. Тут вона пізнає магію справжньої піци, італійської мови та мистецтво «dolce far niente» — насолоду " +
                "від нічогонероблення.\r\n\r\nІндія (Молитися): В індійському ашрамі, серед тиші та суворих правил, героїня " +
                "намагається приборкати свій розум. Це складний етап боротьби з внутрішніми демонами, почуттям провини та болем " +
                "минулого через медитації та молитву.\r\n\r\nІндонезія (Кохати): На мальовничому острові Балі Елізабет шукає " +
                "баланс між земними задоволеннями та духовністю. Несподівано для самої себе, вона зустрічає бразильця Феліпе, " +
                "який змушує її серце знову битися частіше. Тепер їй належить вирішити: чи готова вона знову відкритися для " +
                "любові, ризикуючи втратити щойно віднайдену внутрішню свободу.\r\n\r\nЧому цей фільм є обов'язковим до " +
                "перегляду:\r\nГрандіозна акторська робота: Джулія Робертс демонструє неймовірний спектр емоцій, примушуючи " +
                "глядача проживати кожен крок її трансформації як свій власний.\r\n\r\nАтмосфера та візуал: Фільм знятий " +
                "настільки майстерно, що ви майже відчуваєте аромат пасти в Римі та теплий вітер Балі. Це ідеальна терапія " +
                "для тих, хто втомився від рутини.\r\n\r\nФілософський зміст: Це не просто жіноча мелодрама, а глибока історія " +
                "про те, що ніколи не пізно визнати свої помилки та почати життя з чистого аркуша.\r\n\r\nЗірковий склад: " +
                "Хав'єр Бардем, Джеймс Франко та Віола Девіс додають цій історії особливої ваги та професіоналізму." },

                new Film
                {
                    Id = 2,
                    Name = "Майкл",
                    Director = "Антуан Фукуа",
                    Genre = " біографія, драма, музика",
                    Year = 2026,
                    Poster = "/posters/michael.jpg",
                    Info = "Фільм розповідає історію Майкла Джексона поза межами музики — шлях від відкриття його виняткового таланту як " +
                "фронтмена The Jackson Five до становлення візіонера, чия творча амбіція підживлювала невтомне прагнення стати найбільшим " +
                "артистом світу."
                },

                new Film { Id = 3, 
                    Name = "1 + 1", 
                    Director = "Олів'є Накаш, Ерік Толедано", 
                    Genre = "драма, комедії", 
                    Year = 2011, 
                    Poster = "/posters/1plus1.jpg", 
                    Info = "Це зворушлива і водночас кумедна історія про незвичайну дружбу між паралізованим аристократом Філіпом " +
                    "і молодим вихідцем із бідних кварталів Дріссом. Після нещасного випадку Філіп шукає доглядальника, але обирає " +
                    "не фахівця, а енергійного хлопця, який лише формально прийшов на співбесіду. Проте саме Дрісс вносить у життя " +
                    "Філіпа щиру радість і допомагає йому знову відчути смак до життя. Їхня історія доводить, що справжня дружба може " +
                    "виникнути там, де її найменше очікуєш, і здатна зруйнувати будь-які соціальні та культурні бар'єри …"
                },

                new Film { Id = 4, 
                    Name = "Щоденник пам'яті", 
                    Director = "Нік Кассаветіс", 
                    Genre = "драма, мелодрама", 
                    Year = 2004, 
                    Poster = "/posters/memory.jpg", 
                    Info = "Зворушлива романтична драма, заснована на бестселері Ніколаса Спаркса. Це історія кохання, що проходить крізь " +
                "роки та випробування. У центрі сюжету – Ной і Еллі, двоє молодих людей з різних соціальних світів, які закохуються одне " +
                "в одного влітку. Однак життя, соціальні бар'єри і війна розділяють їх на довгі роки. Попри всі перешкоди, їхні почуття " +
                "залишаються живими. Історія розповідається від імені літнього чоловіка, який читає з потертого щоденника про незабутнє кохання, " +
                "нагадуючи, що справжні почуття здатні витримати випробування часом і навіть втратою пам’яті …"
                },
                
                new Film { Id = 5, 
                    Name = "Ілюзія обману 3", 
                    Director = " Рубен Флейшер ", 
                    Genre = "комедія, кримінал, екшн", 
                    Year = 2025, 
                    Poster = "/posters/illusion.jpeg", 
                    Info = "Діамантова афера знову об’єднує легендарних “Вершників”, які повертаються з відставки, щоб разом із новим поколінням " +
                    "ілюзіоністів дати бій небезпечним злочинцям."
                },

                new Film { Id = 6, 
                    Name = "Джон Уік 4", 
                    Director = "Чад Стахелскі", 
                    Genre = "бойовик, кримінал, трилер", 
                    Year = 2023, 
                    Poster = "/posters/uik.jpg", 
                    Info = "Джон Уік знаходить спосіб подолати злочинну організацію «Високий Стіл». Проте, перш ніж здобути свободу, Уік має " +
                    "стикнутися з новим ворогом, який має могутніх союзників у всьому світі, та з силами, що перетворюють старих друзів на ворогів."
                },

                new Film { Id = 7, 
                    Name = "Роккі Бальбоа", 
                    Director = "Сільвестер Сталлоне",
                    Genre = "драма, спорт", 
                    Year = 2006, 
                    Poster = "/posters/rokky.jpg", 
                    Info = "Колишній боксер Роккі вже досить давно відійшов від справ. Його кохана дружина померла, а син дуже рідко спілкується " +
                    "з батьком. Роккі розпочав власний бізнес. Він відкрив ресторан, де проводить багато часу, розповідаючи відвідувачам про свої " +
                    "колишні бої. Одного разу чемпіонові випадає нагода знову вийти на ринг. "
                },

                new Film { Id = 8, 
                    Name = "Гола правда", 
                    Director = "Роберт Лукетіч", 
                    Genre = "Фільм, Комедія, Мелодрама", 
                    Year = 2009, 
                    Poster = "/posters/truth.jpg", 
                    Info = "Головна героїня фільму — успішна телеведуча, яка живе керуючись виключно строгими моральними принципами, у якої не все " +
                    "гаразд на особистому фронті. Їй не властиво легкодумство і слабкість, як більшості жінок, Еббі сильна і вольова, здатна зрушити " +
                    "гори заради своїх ідеалів і благих намірів. Але долати труднощі стає складніше, коли на горизонті з'являється Майк зі своїм " +
                    "провокаційним шоу «Гола правда». Чи зможе Еббі ділити студію з новим ведучим, або ця затія обернеться справжньою катастрофою?"
                },

                new Film { Id = 9, 
                    Name = "F1", 
                    Director = "Джозеф Косінскі", 
                    Genre = "Фільм, Драма, Спортивний", 
                    Year = 2025, 
                    Poster = "/posters/formula.jpg", 
                    Info = "На початку 1990-х років Сонні Гейс був перспективним пілотом «Формули-1», проте серйозна аварія поклала край його " +
                    "професійній кар'єрі. З того часу життя чоловіка пішло під укіс: він тричі був одружений, набув ігрової залежності та живе " +
                    "на межі банкрутства, працюючи другосортним гонщиком за наймом. Вкотре продемонструвавши свою майстерність у перегонах " +
                    "«24 години Дейтони», Сонні привертає увагу старого друга Рубена Сервантеса, який просить його стати частиною своєї команди " +
                    "«Формули-1», що переживає не найкращі часи."
                },

                new Film { Id = 10, 
                    Name = "Вовк з Волл-стріт", 
                    Director = "Мартін Скорсезе", 
                    Genre = "Фільм, Драма, Кримінал, Біографічний", 
                    Year = 2013, 
                    Poster = "/posters/street.jpg", 
                    Info = "За основу проєкту були взяті однойменні мемуари Джордана Белфорта, колишнього нью-йоркського брокера. В кінці 80-х " +
                    "він заснував одну з найбільших брокерських контор. Він купався в грошах, славі, розвагах і наркотичному угарі, спритно " +
                    "провертаючи махінації. У цих нестримних веселощах пройшли 10 років, а потім Белфорта засудили за відмивання грошей та інші " +
                    "фінансові злочини. Він покінчив з алкоголем і наркотиками, і відсидівши призначені три роки, Джордан пише пару книг і " +
                    "розповідає молодому поколінню, як прийти до успіху..."
                }
            );
        }
    }
}
